{
  "string": [
    {
      "name": "module_desc",
      "value": "模块描述"
    },
    {
      "name": "EntryAbility_desc",
      "value": "description"
    },
    {
      "name": "EntryAbility_label",
      "value": "label"
    },
    {
      "name": "Register",
      "value": "注 册"
    },
    {
      "name": "Passwd_tip",
      "value": "请输入正确的密码格式"
    },
    {
      "name": "Login",
      "value": "登 录"
    },
    {
      "name": "Login_action",
      "value": "登 入"
    },
    {
      "name": "Password",
      "value": "密 码"
    },
    {
      "name": "User",
      "value": "手机号码/邮箱地址"
    },
    {
      "name": "Service",
      "value": "联系客服"
    },
    {
      "name": "ForgetPassword",
      "value": "忘记密码"
    },
    {
      "name": "PhoneNum",
      "value": "电话号码"
    },
    {
      "name": "GetCode",
      "value": "获取验证码"
    },
    {
      "name": "PrivacyAgreement",
      "value": "隐私协议"
    },
    {
      "name": "AgreePrivacy",
      "value": "接受并继续"
    },
    {
      "name": "Disagree",
      "value": "我再看看"
    },
    {
      "name": "PrivacyAgree_text",
      "value": "您好，欢迎使用本产品。\n您在使用我们的产品或服务时，为了提升产品用户体验，我们可能会收集和使用您的一些相关信息。当您使用本产品时，您需要同意本隐私政策的任何内容。我们将通过下面的《隐私政策》阐明我们如何收集、使用、保存、分享您的信息。\n您对您的个人信息的处理享有知情权、决定权、查询权、更正权、补充权、删除权、复制权、可携带权、有权限制或者拒绝他人对您个人信息进行处理等权利 ，法律、行政法规另有规定的除外。若您对本隐私政策或与本隐私政策相关事宜有任何问题、建议或投诉，请联络客服xxxx-xxxxxx，我们会尽快做出答复。希望您在使用我们的产品或服务前仔细阅读并确认您已经充分理解本政策所写明的内容。\n下文将带您详细了解我们如何收集、使用、存储、传输、共享、转让（如适用）与保护个人信息；帮您了解查询、访问、删除、更正个人信息的方式。\n一、我们如何收集和使用个人信息\n1.1您在注册账户或使用我们的服务时，向我们提供的相关个人信息，例如您的姓名、电子邮件地址、电话号码、设备MAC地址等信息。如果您想充分使用我们提供的各种分享功能，可能还需要创建公开显示的个人资料，其中可能会包含您的姓名和照片\n1.2您通过我们的服务向其他方提供的共享信息以及您使用我们的服务时上传、提交、存储、发送或接收的信息\n1.3我们会收集您使用的服务以及使用方式的信息，如您何时在本产品进行运动，或何时查看了我们运动社区。此类信息包括：\n①设备信息:我们会收集设备专用的信息，例如您的IMSI、ANDROID ID、手机MAC信息、硬件型号、操作系统信息、移动设备版本、设备识别码、屏幕分辨率等信息\n②日志信息:设备或软件信息，例如您的移动设备、网页浏览器或用于接入我们服务的其他程序所提供的配置信息、您的IP地址和移动设备所用的版本和设备识别码\n③IP地址: 有关您会使用的移动应用(App)和其他软件的信息，以及您曾经使用该等移动应用和软件的信息\n④设备中的图片、软件名、版本号等 为了给您提供全方位的运动体验，经过您的授权，我们的服务器会提取您设备中的图片、软件名、版本号等，并通过加密上传到服务器进行比对，用于匹配与该图片、版本相对应的显示功能\n⑤位置信息：为了地图导航和其他位置服务相关目的，我们的产品中会嵌入合作方的SDK或其他类似的应用程序，例如华为Patle Map SDK需要您打开设备位置权限并收集设备所在位置相关信息、设备识别号、联网相关信息。您可以授权开启设备定位功能并使用我们基于位置提供的相关服务，当然，您也可以通过关闭定位功能随时停止我们对您的地理位置信息的收集\n⑥自主选择完善的信息 您登录之后可以完善您的个人资料，您一旦选择、编辑、填写了您的信息，就视为您同意提供，请您谨慎提供。 您可以完善的个人资料包括更换头像、更改用户名，设置个性简介，选择性别、生日、地区。您更换头像时，需要调用您的相机权限或存储权限，如果您拒绝调用，则无法更换头像。\n(二)我们如何使用您的信息 我们可能将上述收集的信息用作以下用途: \n1、向您提供服务 \n2、在我们提供服务时，用于身份验证、客户服务、安全防范、存档和备份用途，确保我们向您提供的产品和服务的安全性 \n3、帮助我们设计新服务，改善我们现有服务 \n4、使我们更加了解您如何接入和使用我们的服务，从而针对性地回应您的个性化需求，或对您和其他用户作出其他方面的回应\n5、执行软件验证、升级服务\n6、应用户特殊要求而提供特定服务时，需要将信息提供给我们的关联公司、第三方或其他用户\n7、其他有利于用户和本产品运营者利益且不违反任何强制性法律法规的情况\n8、让您参与有关我们产品和服务的调查\n二、如何更新、变更、导出、删除您的信息\n1、你在使用我们的产品和服务时，会被要求提供您真实的个人信息，您应当对您所提供信息的真实性、合法性、有效性及完整性负责，并及时更新和维护您的个人信息，以保证信息的真实、合法和有效。您可以随时管理您的个人信息，例如您的个人账户注册信息。\n2、您可以自行从本账号中删除您的内容或个人信息，或要求我们删除或修改信息，例如您想要删除个人帐户，可以发送邮件到XXXXXXXX@bistu.edu.cn.com与我们联络并提出您的要求\n3、在有些情况下，我们会出于法律目的或合法务的需要将数据保留有限的一段时间，我们会尽力确保本的服务能够保护信息免遭意外或恶意删除。因此，如果您删除了某些内容，我们可能会过一段时间才会从我们现用的和备用的系统中删除其副本，您可以随时备份个人帐户名下的内容或将其用于非本服务，您可以发邮件到XXXXXXXX@bistu.edu.cn.com与我们联络并提出您的要求\n三、我们如何保护您的个人信息 所有本产品都内置了强大的安全功能，并且我们制定了严格的信息管理政策，配备专业的技术团队，采取了一系列合理的预防措施，以保护您的个人信息不会遭受未经授权的浏览、披露、滥用、变更、破坏以及损失，其中包括\n(1)使用加密技术来确保您的数据在传输过程中保持私密性;\n(2)提供多种安全功能来协助您保护自己的帐号安全\n(3)审查我们在收集、存储和处理信息方面的做法(包括实体安全措施)，以防未经授权的人员访问我们的系统\n四、您分享的信息 \n1、我们会提供社交网络服务，您在使用这一类型服务时，您所上传或发布的信息(包括您公开的个人信息、照片、运动记录、动态)、您对他人上传或发布的信息作出的回应，以及与这些信息有关的日志信息等，只要您不删除这些信息，它们会一直留存在公共领域，并被使用我们服务的其他用户分享、浏览，即使您删除这些信息，有关信息仍可能由其他用户或不受我们控制的非关联第三方独立地缓存、复制或储存，或由其他用户或第三方在公共领域保存 \n2、请您谨慎考虑通过我们的服务上传、发布和交流的信息内容。您可以自行删除您上传、发布或分享的信息，如要求我们为您删除您的相关信息，请发送邮件到XXXXXXXX@bistu.edu.cn.com与我们联络并提出您的要求 \n五、本政策的更新 \n随着法律法规的出台或修订，我们的《隐私政策》可能会发生变更。条款内容变更后，我们会以公告或站内信的形式通知您我们对条款所做的任何变更，或以其他适当方式提醒您相关内容的更新 \n六、适用范围 \n1、我们的隐私政策适用于由本技术团队提供的所有服务\n2、我们的隐私权政策不适用于第三方提供的产品和服务，在我们的服务中链接到的其他网站，这些产品、服务或网站会有独立的隐私政策予以规范，请另行查阅相应的政策规定\n七、注销、更正、修改或删除资料 在成功登录之后，用户可以在“设置”页面下更正，修改或删除个人信息及密码，以及账号注销"
    },
    {
      "name": "rightPhone",
      "value": "请输入合法的手机号码"
    },
    {
      "name": "Back",
      "value": "返 回"
    },
    {
      "name": "Me",
      "value": "我的"
    },
    {
      "name": "Running",
      "value": "健康跑"
    },
    {
      "name": "Dynamics",
      "value": "动 态"
    },
    {
      "name": "Educational",
      "value": "教 务"
    },
    {
      "name": "Record",
      "value": "跑步记录"
    },
    {
      "name": "Rank",
      "value": "排行榜"
    },
    {
      "name": "Goal",
      "value": "跑步目标"
    },
    {
      "name": "Start",
      "value": "开始运动"
    },
    {
      "name": "Time",
      "value": "时 间"
    },
    {
      "name": "Speed",
      "value": "速 度"
    },
    {
      "name": "AvgSpeed",
      "value": "平均速度"
    },
    {
      "name": "Mileage",
      "value": "里 程"
    },
    {
      "name": "StepFrequency",
      "value": "步 频"
    }
  ]
}